In [1]:
import numpy as np
import pandas as pd

In [2]:
a = pd.Series([1, 2, 3, 4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
print(a+1)
print(a-1)
print(a*2)
print(a/2)
print(a//2)
print(a%2)
print(a**2)
print(2**a)

0    2
1    3
2    4
3    5
dtype: int64
0    0
1    1
2    2
3    3
dtype: int64
0    2
1    4
2    6
3    8
dtype: int64
0    0.5
1    1.0
2    1.5
3    2.0
dtype: float64
0    0
1    1
2    1
3    2
dtype: int64
0    1
1    0
2    1
3    0
dtype: int64
0     1
1     4
2     9
3    16
dtype: int64
0     2
1     4
2     8
3    16
dtype: int64

In [4]:
b = pd.Series([30, 20, 10, 40], index=['c', 'b', 'a', 'd'])
b

c    30
b    20
a    10
d    40
dtype: int64

In [5]:
a+b

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [6]:
data1 = {'Seoul':4000, 'Busan':2000, 'Incheon':1500, 'Gwangju':1000}
cities = ['Seoul','Daegu','Incheon','Gwangju']

c = pd.Series(data1)
d = pd.Series(data1, index=cities)

print(c)
print(d)

Seoul      4000
Busan      2000
Incheon    1500
Gwangju    1000
dtype: int64
Seoul      4000.0
Daegu         NaN
Incheon    1500.0
Gwangju    1000.0
dtype: float64

In [7]:
print(c+d)
print(c-d)
print(c*d)
print(c/d)
print(c//d)
print(c%d)
print(c**d)

Busan         NaN
Daegu         NaN
Gwangju    2000.0
Incheon    3000.0
Seoul      8000.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    0.0
Incheon    0.0
Seoul      0.0
dtype: float64
Busan             NaN
Daegu             NaN
Gwangju     1000000.0
Incheon     2250000.0
Seoul      16000000.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    1.0
Incheon    1.0
Seoul      1.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    1.0
Incheon    1.0
Seoul      1.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    0.0
Incheon    0.0
Seoul      0.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    inf
Incheon    inf
Seoul      inf
dtype: float64

In [9]:
x = pd.DataFrame(np.arange(12).reshape(3, 4),
                columns = list('abcd'))
x

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [10]:
x+1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [11]:
x-1

   a  b  c   d
0 -1  0  1   2
1  3  4  5   6
2  7  8  9  10

In [12]:
x*2

    a   b   c   d
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22

In [13]:
x/2

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [14]:
x//2

   a  b  c  d
0  0  0  1  1
1  2  2  3  3
2  4  4  5  5

In [15]:
x%2

   a  b  c  d
0  0  1  0  1
1  0  1  0  1
2  0  1  0  1

In [18]:
x**2

    a   b    c    d
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [19]:
2**x

     a    b     c     d
0    1    2     4     8
1   16   32    64   128
2  256  512  1024  2048

In [20]:
y = pd.DataFrame(np.arange(20).reshape(4, 5),
                columns=list('abcde'))
y

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [21]:
x+y

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [22]:
x-y

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [23]:
x*y

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [24]:
x/y

     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8  0.833333  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [25]:
x//y

     a    b    c    d   e
0  NaN  1.0  1.0  1.0 NaN
1  0.0  0.0  0.0  0.0 NaN
2  0.0  0.0  0.0  0.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [26]:
x%y

     a    b     c     d   e
0  NaN  0.0   0.0   0.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN
3  NaN  NaN   NaN   NaN NaN

In [27]:
x**y

              a             b             c             d   e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01 NaN
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06 NaN
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13 NaN
3           NaN           NaN           NaN           NaN NaN

In [28]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),
                  columns=list('bde'),
                  index=['seoul', 'busan', 'incheon', 'suwon'])
df

         b   d   e
seoul    0   1   2
busan    3   4   5
incheon  6   7   8
suwon    9  10  11

In [29]:
s = df.iloc[0]
s

b    0
d    1
e    2
Name: seoul, dtype: int64

In [30]:
df-s

         b  d  e
seoul    0  0  0
busan    3  3  3
incheon  6  6  6
suwon    9  9  9

In [31]:
s2 = pd.Series(range(3), index=list('bef'))
s2

b    0
e    1
f    2
dtype: int64

In [32]:
df+s2

           b   d     e   f
seoul    0.0 NaN   3.0 NaN
busan    3.0 NaN   6.0 NaN
incheon  6.0 NaN   9.0 NaN
suwon    9.0 NaN  12.0 NaN

In [33]:
s3 = df['d']
s3

seoul       1
busan       4
incheon     7
suwon      10
Name: d, dtype: int64

In [34]:
s3 = df['d']
df+s3

          b  busan   d   e  incheon  seoul  suwon
seoul   NaN    NaN NaN NaN      NaN    NaN    NaN
busan   NaN    NaN NaN NaN      NaN    NaN    NaN
incheon NaN    NaN NaN NaN      NaN    NaN    NaN
suwon   NaN    NaN NaN NaN      NaN    NaN    NaN

In [35]:
df-s3

          b  busan   d   e  incheon  seoul  suwon
seoul   NaN    NaN NaN NaN      NaN    NaN    NaN
busan   NaN    NaN NaN NaN      NaN    NaN    NaN
incheon NaN    NaN NaN NaN      NaN    NaN    NaN
suwon   NaN    NaN NaN NaN      NaN    NaN    NaN

In [36]:
print(x)
print(y)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [37]:
z = np.array([-1, 2.37, 3.56, -4.92, 5.61, 6, -1.25, 4, 5]).reshape(3, 3)
z = pd.DataFrame(z, columns=list('abf'))
z

      a     b     f
0 -1.00  2.37  3.56
1 -4.92  5.61  6.00
2 -1.25  4.00  5.00

In [38]:
x.add(y)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [39]:
x2 = x.copy()
x2 = x2.reindex(columns=y.columns, fill_value=0)
x2.loc[3, :] = [0, 0, 0, 0, 0]
x2

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

In [40]:
x2.add(y)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [41]:
x.add(y, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [42]:
x.add(y, fill_value=2)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   6.0
1   9.0  11.0  13.0  15.0  11.0
2  18.0  20.0  22.0  24.0  16.0
3  17.0  18.0  19.0  20.0  21.0

In [43]:
df.add(s3, axis=0)

          b   d   e
seoul     1   2   3
busan     7   8   9
incheon  13  14  15
suwon    19  20  21

In [44]:
df.sub(s3, axis=0)

         b  d  e
seoul   -1  0  1
busan   -1  0  1
incheon -1  0  1
suwon   -1  0  1

In [45]:
x.sub(y)

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [46]:
x.diff()

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  4.0  4.0  4.0  4.0
2  4.0  4.0  4.0  4.0

In [47]:
x.diff(axis=0)

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  4.0  4.0  4.0  4.0
2  4.0  4.0  4.0  4.0

In [48]:
x.diff(axis=1)

    a    b    c    d
0 NaN  1.0  1.0  1.0
1 NaN  1.0  1.0  1.0
2 NaN  1.0  1.0  1.0

In [49]:
x.mul(y)

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [50]:
x.prod()

a      0
b     45
c    120
d    231
dtype: int64

In [51]:
x.prod(axis=0)

a      0
b     45
c    120
d    231
dtype: int64

In [52]:
x.prod(axis=1)

0       0
1     840
2    7920
dtype: int64

In [53]:
x.div(y)

     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8  0.833333  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [54]:
x.pow(y)

              a             b             c             d   e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01 NaN
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06 NaN
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13 NaN
3           NaN           NaN           NaN           NaN NaN

In [55]:
x.mod(y)

     a    b     c     d   e
0  NaN  0.0   0.0   0.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN
3  NaN  NaN   NaN   NaN NaN

In [57]:
z.abs()

      a     b     f
0  1.00  2.37  3.56
1  4.92  5.61  6.00
2  1.25  4.00  5.00

In [58]:
np.add(x, y)

ValueError: operands could not be broadcast together with shapes (3,4) (4,5)

In [59]:
w = y.copy()
w = w.drop(3)
del w['e']

print(y)
print(w)

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
    a   b   c   d
0   0   1   2   3
1   5   6   7   8
2  10  11  12  13

In [60]:
np.add(x, w)

    a   b   c   d
0   0   2   4   6
1   9  11  13  15
2  18  20  22  24

In [61]:
np.subtract(x, w)

   a  b  c  d
0  0  0  0  0
1 -1 -1 -1 -1
2 -2 -2 -2 -2

In [62]:
np.multiply(x, w)

    a   b    c    d
0   0   1    4    9
1  20  30   42   56
2  80  99  120  143

In [63]:
np.divide(x, w)

<ipython-input-63-5c5c927cbb06>:1: RuntimeWarning: invalid value encountered in true_divide
  np.divide(x, w)

     a         b         c         d
0  NaN  1.000000  1.000000  1.000000
1  0.8  0.833333  0.857143  0.875000
2  0.8  0.818182  0.833333  0.846154

In [64]:
np.power(x, w)

            a            b              c               d
0           1            1              4              27
1        1024        15625         279936         5764801
2  1073741824  31381059609  1000000000000  34522712143931

In [65]:
print(np.modf(z))

(      a     b     f
0 -0.00  0.37  0.56
1 -0.92  0.61  0.00
2 -0.25  0.00  0.00,      a    b    f
0 -1.0  2.0  3.0
1 -4.0  5.0  6.0
2 -1.0  4.0  5.0)

In [66]:
print(np.modf(z)[0])
print(np.modf(z)[1])

      a     b     f
0 -0.00  0.37  0.56
1 -0.92  0.61  0.00
2 -0.25  0.00  0.00
     a    b    f
0 -1.0  2.0  3.0
1 -4.0  5.0  6.0
2 -1.0  4.0  5.0

In [67]:
np.fabs(z)

      a     b     f
0  1.00  2.37  3.56
1  4.92  5.61  6.00
2  1.25  4.00  5.00

In [68]:
np.sqrt(x)

          a         b         c         d
0  0.000000  1.000000  1.414214  1.732051
1  2.000000  2.236068  2.449490  2.645751
2  2.828427  3.000000  3.162278  3.316625

In [69]:
np.square(x)

    a   b    c    d
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [70]:
np.exp(x)

             a            b             c             d
0     1.000000     2.718282      7.389056     20.085537
1    54.598150   148.413159    403.428793   1096.633158
2  2980.957987  8103.083928  22026.465795  59874.141715

In [71]:
np.log(x)

<ipython-input-71-de666c833898>:1: RuntimeWarning: divide by zero encountered in log
  np.log(x)

          a         b         c         d
0      -inf  0.000000  0.693147  1.098612
1  1.386294  1.609438  1.791759  1.945910
2  2.079442  2.197225  2.302585  2.397895

In [72]:
np.log1p(x)

          a         b         c         d
0  0.000000  0.693147  1.098612  1.386294
1  1.609438  1.791759  1.945910  2.079442
2  2.197225  2.302585  2.397895  2.484907

In [73]:
np.maximum(x, w)

    a   b   c   d
0   0   1   2   3
1   5   6   7   8
2  10  11  12  13

In [74]:
np.minimum(x, w)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [75]:
np.gradient(x)

[array([[4., 4., 4., 4.],
        [4., 4., 4., 4.],
        [4., 4., 4., 4.]]),
 array([[1., 1., 1., 1.],
        [1., 1., 1., 1.],
        [1., 1., 1., 1.]])]

In [76]:
np.gradient(x, axis=0)

array([[4., 4., 4., 4.],
       [4., 4., 4., 4.],
       [4., 4., 4., 4.]])

In [77]:
np.gradient(x, axis=1)

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])